{
  "fixerProfile": {
    "title": "Dexter DeShawn",
    "image": "/dexter.png",
    "aliases": ["Dex", "Mr. Major Leagues"],
    "status": "Deceased (as of 2077)",
    "primaryTerritory": "City-Wide Operations (Prefers Watson, Heywood)",
    "specialization": "High-Stakes Heists, Crew Assembly, Major League Contracts",

    "biography": {
      "earlyLife": "Dexter DeShawn didn't crawl up from the gutter; he walked into the game with a business plan. He was never a solo, netrunner, or techie. His talent was people—reading them, charming them, and pointing them at a target. He built his reputation not on personal grit, but on his ability to orchestrate complex operations and sell the dream of hitting the big time to up-and-coming mercs.",
      "riseAsFixer": "For a time, Dex was one of the most talked-about fixers in Night City. He had a knack for finding talent and securing the kind of high-profile gigs that could make a merc a legend overnight. He cultivated an image of success and confidence, operating out of lavish temporary bases and always promising a life-changing score. However, a major job went south a few years back, forcing him to lay low and damaging his reputation among the city's elite.",
      "modusOperandi": "Dex's approach was always about the 'one big score.' He specialized in assembling specialized crews for audacious heists that other fixers wouldn't touch. He was a master of the pitch, making every job sound like a guaranteed ticket to the Afterlife's VIP lounge. In practice, he was often disconnected from the ground-level details, relying on his crew's expertise to fill the gaps in his planning. His fatal flaw was a deep-seated instinct for self-preservation that overrode any sense of loyalty.",
      "reputation": "Posthumously, Dexter DeShawn is a cautionary tale whispered among mercs. He represents the ultimate danger of the business: a fixer who will sacrifice his crew without a second thought to save his own skin. While he once represented ambition and opportunity, his name is now synonymous with betrayal. He promised the major leagues but delivered a shallow grave."
    },

    "legendaryGig": {
        "gigTitle": "The Samurai Gold Heist",
        "date": "Circa 2074",
        "objective": "Infiltrate the heavily fortified UMG (Universal Music Group) Tower in Corpo Plaza and steal the original, unreleased master recordings of Samurai's final album, 'Black Dog'.",
        "client": "A reclusive, anonymous billionaire collector.",
        "target": "Samurai 'Black Dog' Master Recordings",
        "outcome": "A chaotic success. Dex assembled a three-person crew that bypassed UMG's state-of-the-art security to reach the vault. However, the extraction was messy, triggering a high-alert and a city-wide media frenzy. The crew escaped after a prolonged and highly public chase through the streets of City Center, becoming overnight legends. Dex, watching from a safe distance, took all the credit for orchestrating the 'impossible' heist.",
        "hiredMercs": "'Spike' (Solo), 'Bitstream' (Netrunner), 'Ricochet' (Wheelman)",
        "mercFeedback": "'The payout was life-changing, no doubt. Dex got us the gear and the codes to get in, and for that, he's a genius. But his escape plan? 'Drive fast and don't die.' We were on our own the second that alarm went off. He plans the perfect entrance, but you better plan your own exit. Still, what a score.' - 'Ricochet' (Wheelman)",
        "payout": "€$ 300,000 (Split three ways)",
        "reputationImpact": "This was the job that put Dex in the major leagues. It was loud, flashy, and aimed at a cultural icon, generating massive street cred. It proved he could assemble a top-tier crew and hit the most secure targets in the city. For years, mercs flocked to him, hoping to replicate this legendary success, conveniently ignoring the near-fatal chaos of the escape."
    },

    "fixerRatings": {
      "overallThreat": "7/10 (Deceptive)",
      "reliability": "1/10 - Catastrophic. Will betray and execute his own crew to cover his tracks or escape consequences. He is the single greatest threat on any of his jobs.",
      "payment": "5/10 - Promises legendary payouts, but will withhold funds or eliminate the contractor if the job has complications.",
      "intelQuality": "6/10 - Provides the broad strokes and can secure high-level access, but often misses critical, ground-level details that can prove fatal.",
      "discretion": "3/10 - His flashy style and big talk attract attention. His operations are loud and tend to draw significant heat.",
      "resourcefulness": "8/10 - Excellent at networking and acquiring high-end gear and specialized talent for his crews. His main strength.",
      "mercSurvivability": "2/10 - Working for Dex is a gamble where the house is rigged. Survival is unlikely if the mission deviates even slightly from the plan."
    },

    "advantages": {
      "strengths": [
        "Excellent at scouting and assembling talented mercenary crews.",
        "Has connections to secure high-end, often illegal, cyberware and weaponry.",
        "Ambitious; the gigs he offers have the potential for massive rewards.",
        "A charismatic and persuasive negotiator."
      ],
      "weaknesses": [
        "Fundamentally untrustworthy and cowardly under pressure.",
        "His planning often has critical intelligence gaps.",
        "Prioritizes his own escape and survival over the success of the mission or his crew.",
        "His high-profile jobs attract the attention of major corporations like Arasaka."
      ]
    },

    "recentGigDetails": [
      {
        "gigTitle": "The Heist",
        "date": "Mid-2077",
        "objective": "Infiltrate Konpeki Plaza and steal the 'Relic' biochip from Yorinobu Arasaka's penthouse.",
        "client": "Evelyn Parker (Self-Intermediary)",
        "target": "The 'Relic' Biochip (Prototype)",
        "outcome": "Catastrophic Failure. The crew successfully infiltrated the penthouse but were trapped when Saburo Arasaka unexpectedly arrived and was subsequently murdered by his son, Yorinobu. This triggered a full Arasaka lockdown. Crew members T-Bug and Jackie Welles were killed during the operation. The surviving merc was betrayed by DeShawn, shot, and left for dead in a landfill.",
        "mercFeedback": "'He set us up. The intel was bad, the escape plan was smoke, and when the heat came down, he put a bullet in my head. Don't walk away from this guy. Run.' - 'V' (Surviving Mercenary)",
        "payout": "€$ 0 (Betrayed and Executed)"
      },
      {
        "gigTitle": "The Pickup",
        "date": "Mid-2077",
        "objective": "Acquire a Militech 'Flathead' combat bot from the Maelstrom gang, who had stolen it from a Militech convoy.",
        "client": "Self (for 'The Heist')",
        "target": "Militech 'Flathead' Droid",
        "outcome": "Successful, but resulted in extreme violence. Dex's prior dealings with the former Maelstrom leader, Brick, were voided by the new leader, Royce, forcing a bloody confrontation. A Militech agent, Meredith Stout, was also involved, further complicating the situation. The bot was secured, but the operation escalated into a massacre.",
        "mercFeedback": "'Dex sent us into a goddamn slaughterhouse. Said it was a simple pickup. Nothing's simple with him. We got the bot, but the body count was insane.' - Jackie Welles (Mercenary)",
        "payout": "Rolled into 'The Heist' contract"
      },
      {
        "gigTitle": "The Information",
        "date": "Mid-2077",
        "objective": "Meet with the client, Evelyn Parker, and use a braindance to conduct reconnaissance on Yorinobu Arasaka's penthouse.",
        "client": "Evelyn Parker",
        "target": "Penthouse Security Intel",
        "outcome": "Successful. The merc, guided by T-Bug, analyzed the braindance and identified key security vulnerabilities and the location of the Relic. This provided the core intel for 'The Heist.' Dex remained hands-off, acting only as the primary coordinator.",
        "mercFeedback": "'Standard BD recon. The client, Evelyn, seemed to know more than she was letting on. Dex was just the money man, connecting the dots.' - T-Bug (Netrunner)",
        "payout": "Upfront payment & inclusion in 'The Heist'"
      }
    ]
  }
}