{
  "fixerProfile": {
    "title": "Muamar 'El Capitán' Reyes",
    "image": "/choom.png",
    "aliases": ["El Capitán", "The Captain", "King of the Racetrack"],
    "status": "Active",
    "primaryTerritory": "Santo Domingo (Arroyo, Rancho Coronado)",
    "specialization": "Vehicle Acquisition & Theft, Corporate Sabotage, Street Justice, Smuggling",

    "biography": {
      "earlyLife": "Muamar Reyes wasn't born into power; he earned it. He started as a logistics specialist for a mid-level corporation, a corpo rat stuck in the endless grind of Santo Domingo's industrial sector. He saw firsthand how the corps squeezed every last drop of life from the district and its people. Deciding he'd rather be the one doing the squeezing, he quit, cashed in his pension, and used his insider knowledge of shipping routes and corporate security to start his own 'logistics' business.",
      "riseAsFixer": "He adopted the moniker 'El Capitán' and quickly became the go-to fixer for Santo Domingo. His edge was his unique blend of corpo professionalism and street-level empathy. He understood both the language of the boardroom and the struggles of the factory worker. He built a reputation as a fair, if demanding, boss. He's a self-made king who rules from the driver's seat of his armored limo, with a network of spies in every garage and warehouse in the district.",
      "modusOperandi": "El Capitán's true passion is cars. Any gig involving rare, fast, or armored vehicles will immediately get his attention. His primary business is a high-end vehicle acquisition service for wealthy clients, but he also handles a wide range of jobs, from sabotaging rival corporate facilities to dispensing a bit of vigilante justice on gangs that prey on the locals. He's pragmatic and business-minded, but he has a soft spot for Santo Domingo and will often commission gigs that, while profitable, also serve to protect his community.",
      "reputation": "In Santo Domingo, El Capitán's authority is absolute. The NCPD turns a blind eye, and the corps pay him for 'security consulting' that's little more than protection money. To mercs, he is a top-tier employer: demanding, but fair. He provides solid intel, pays what he promises, and values results above all. He's a man who respects hard work and horsepower, and if you can deliver both, you'll always have a place on his payroll."
    },

    "fixerRatings": {
      "overallThreat": "9/10 (High)",
      "reliability": "9/10 - A man of his word. His reputation is his most valuable asset, and he protects it fiercely. Payment is prompt and fair.",
      "payment": "9/10 - Excellent. Offers top-tier eddies and often includes performance-based bonuses, especially for vehicle-related jobs.",
      "intelQuality": "9/10 - Superb for his territory. Has eyes and ears in every factory and garage in Santo Domingo. His corporate intel is also surprisingly solid.",
      "discretion": "7/10 - His operations can be loud, but he's an expert at covering tracks and managing the fallout. He controls the narrative in his district.",
      "resourcefulness": "10/10 - Unmatched in his field. Can source any vehicle in Night City, from scrap heaps to military-grade APCs. His network is vast and loyal.",
      "mercSurvivability": "8/10 - High. While his gigs can be dangerous, his intel is solid and his objectives are clear, reducing the chance of nasty surprises."
    },
     "legendaryGig": {
        "gigTitle": "The Great Concession Heist",
        "date": "05.10.2070",
        "objective": "When the struggling corporation ConAg announced it was closing its Santo Domingo factory and moving all assets, El Capitán was hired to prevent the move and force them to pay their workers. His plan: hijack their entire fleet of 50 cargo haulers in a single night.",
        "client": "The Workers' Union of Arroyo",
        "target": "ConAg's entire Santo Domingo transport fleet and assets.",
        "outcome": "A logistical masterpiece. El Capitán mobilized dozens of mercs and local wheelmen. Using his insider knowledge, he orchestrated a perfectly timed, district-wide series of 'traffic accidents,' roadblocks, and precision EMP strikes that crippled the entire convoy simultaneously. His crews then systematically commandeered every truck, driving them into a network of hidden warehouses. By sunrise, ConAg's fleet had vanished. Faced with total asset loss, the corporation was forced to the negotiating table. El Capitán brokered a deal where the workers received massive severance packages, and he acquired the entire 'stolen' fleet for a fraction of its value.",
        "hiredMercs": "A coalition of mercs and Santo Domingo locals, led by the legendary wheelwoman 'La Fantasma'.",
        "mercFeedback": "'It wasn't a heist, it was a revolution on wheels. The Captain turned the entire district into a mousetrap. We were hitting trucks on a dozen different streets, all at the same time, all on his signal. He didn't just steal some trucks; he flexed and made a corpo bend the knee. He's not the King of Santo Domingo for nothing.' - 'La Fantasma'",
        "payout": "Full ownership of the ConAg transport fleet, cementing his logistics empire.",
        "reputationImpact": "This single operation elevated El Capitán from a simple fixer to a king. He proved that his power wasn't just in hiring solos, but in his ability to command the very streets and infrastructure of his district. He became a legend to the working class and a terrifying reality to any corporation operating in Santo Domingo."
    },
    "advantages": {
      "strengths": [
        "The undisputed master of vehicle acquisition in Night City.",
        "Total control and influence over the Santo Domingo district.",
        "Offers high-paying, straightforward contracts with clear objectives.",
        "A pragmatic but fair employer who values skilled operators."
      ],
      "weaknesses": [
        "His influence wanes significantly outside of Santo Domingo.",
        "Has a strong rivalry with other vehicle-focused factions and fixers.",
        "Gigs often involve direct, heavy combat against corporate security or organized gangs.",
        "Less interested in subtle espionage than in loud, impactful results."
      ]
    },

 "recentGigDetails": [
      {
        "gigTitle": "Assassination of the corpo rat",
        "date": "10.28.2077",
        "objective": "A mid-level manager at the Kiroshi factory in Arroyo has been selling out union leaders to corporate enforcers. El Capitán wants him gone as a message. Make it look like a street robbery gone wrong.",
        "client": "Self-Initiated (Community Protection)",
        "target": "Luka Volkov, Kiroshi Manager",
        "outcome": "Successful. The solo, 'Grim,' tracked the target's routine. Using a beat-up car to block the manager's path in a quiet industrial street, Grim staged a carjacking. The target was eliminated, his personal effects stolen, and the vehicle abandoned a few blocks away. NCPD ruled it a random act of street violence, and corpo retaliation against the union ceased.",
        "mercFeedback": "'El Capitán looks out for his people. This wasn't for some corpo client; this was for the chooms on the factory floor. He gave me the target's whole life on a shard. Made the job simple. He pays well to protect his own.' - 'Grim' (Solo)",
        "payout": "€$ 15,000"
      },
      {
        "gigTitle": "The rescue of the reporter",
        "date": "10.12.2077",
        "objective": "The N54 reporter, Ted Fox, got too close to a 6th Street smuggling operation and has been taken hostage in a warehouse in Rancho Coronado. El Capitán needs him rescued before he's zeroed.",
        "client": "Self-Initiated (Asset Protection)",
        "target": "Ted Fox",
        "outcome": "Successful. A two-merc team hit the warehouse hard and fast. One provided overwatch with a sniper rifle while the other breached the main floor. After a loud and violent firefight with over a dozen 6th Street gangers, the reporter was located, shaken but unharmed, in a storage locker. He was successfully extracted.",
        "mercFeedback": "'The Captain said the reporter was a useful asset, so he wanted him back. Didn't say he had to be happy about it. Lots of lead flew. The pay was good, and now I guess I've got a reporter who owes me a favor.' - 'Havoc' (Mercenary)",
        "payout": "€$ 12,500"
      },
      {
        "gigTitle": "Heist: Arroyo",
        "date": "09.25.2077",
        "objective": "A shipment of advanced cybernetic components is being moved from a Kang Tao warehouse to the spaceport. El Capitán wants it. Intercept the armored convoy and 'liberate' the cargo.",
        "client": "Unnamed Black Market Buyer",
        "target": "Kang Tao Cybernetics Shipment",
        "outcome": "Successful. The team used a heavy-duty EMP charge, provided by El Capitán, to disable the convoy's lead escort vehicle on a highway overpass. The stalled traffic allowed the team to breach the main transport truck with thermal charges. After a short, intense firefight with the convoy guards, the cargo was transferred to the mercs' truck and driven to a drop-off point in the sewers.",
        "mercFeedback": "'You want to hit a Kang Tao convoy, you call El Capitán. He got us the EMP, the route, the manifest... everything but the ammo. It was loud, it was messy, it was beautiful. The payout was legendary.' - 'Boomer' (Techie)",
        "payout": "€$ 30,000"
      }
    ]
  }
}