{
  "fixerProfile": {
    "title": "Rogue Amendiares",
    "image": "/rogue.png",
    "aliases": ["The Queen of the Afterlife", "The Queen of Fixers", "The Ghost of 2023"],
    "status": "Active (Deceased as of 2077, depending on timeline)",
    "primaryTerritory": "Night City (Global Reach from the Afterlife)",
    "specialization": "High-Stakes Operations, Corporate Warfare, Elite Mercenary Contracts, Information Brokerage",
    "biography": {
      "earlyLife": "Before she was a fixer, Rogue was a legend. In the golden age of solos, she was one of the best, a razor-sharp merc who ran the shadows alongside names like Johnny Silverhand and Morgan Blackhand. Her reputation was forged in fire during the corporate wars, culminating in her role in the infamous 2023 assault on Arasaka Tower. While many from that era are now just names on drinks at the Afterlife, Rogue survived—smarter, harder, and more cynical than ever.",
      "riseAsFixer": "After the disappearance of Johnny Silverhand, Rogue traded her guns for information. She realized that the real power wasn't in pulling the trigger, but in knowing who to point the gun at. She took over the Afterlife, transforming it from a simple merc bar into the nexus of the entire Night City underworld. From her personal booth, she built an information empire, becoming the ultimate broker of secrets and violence. All roads in the merc world eventually lead to her throne.",
      "modusOperandi": "Rogue is the final word. She operates with a level of professionalism and detachment that can only come from decades of survival. She deals exclusively in high-stakes, high-payout gigs that are beyond the scope of any other fixer. Her clientele includes the most powerful corporations, media entities, and political players in the world. She is a master strategist who orchestrates events from the shadows, viewing mercs as highly specialized chess pieces in a global game. To even get a meeting with her is to prove you are one of the best.",
      "reputation": "In Night City, Rogue is royalty. She is not just a fixer; she is the system. Her name commands universal respect, born from a legendary past and an iron-fisted control over the present. A contract from Rogue is the pinnacle of a merc's career—a sign that they have entered the major leagues. She is a living monument, the woman who outplayed, outsmarted, and outlived them all."
    },
    "psychologicalProfile": {
      "coreMotivation": "Control. After the chaotic, idealistic, and ultimately failed assault on Arasaka Tower in 2023, Rogue's core motivation shifted from revolution to absolute control. Her entire empire is a fortress built to prevent the kind of loss she experienced from ever happening again. She seeks to be the master of the game, not a player in it, ensuring that she is the one who writes the history, not the one erased by it.",
      "disorders": "Post-Traumatic Stress Disorder (from the 2023 Arasaka raid, manifesting as hyper-vigilance, emotional detachment, and obsessive control), Complicated Grief (for Johnny Silverhand, buried under decades of cynicism).",
      "worldview": "The universe is chaotic and uncaring; ideals are for martyrs. The only things that have value are information, leverage, and the will to use them. She sees the world as a grand, cynical chess match, and she has spent fifty years ensuring she is the one who owns the board. Her pragmatism is a shield forged in the fires of a failed revolution."
    },
    "keyRelationships": {
      "nemesis": "The Ghost of 2023 (An Internal Conflict). Rogue's true nemesis is not a person, but her own past. It is the unresolved trauma of the Arasaka raid, the loss of Johnny Silverhand, and the memory of the idealistic solo she used to be. Adam Smasher is the living, breathing embodiment of this ghost—the monster that represents her greatest failure and the moment she chose survival over ideology. Her entire life since has been a war against the chaos and emotional vulnerability that this ghost represents.",
      "stateOfTheShadowWar": {
        "currentSituation": "A Cold Victory. For fifty years, Rogue has won. She has successfully suppressed the ghost, building an empire of cold, hard logic. She is respected, feared, and untouchable. She has complete control over her world. But it is an empty kingdom, haunted by the memory of what she lost to build it. The fortress is secure, but she is its only prisoner.",
        "roguesResponse": "The Fortress of Cynicism. The Afterlife, her information network, her ruthless professionalism—these are the walls of her fortress. She uses them to keep the chaos of the past at bay. She deals in secrets and death from a distance, never allowing herself to be a pawn on the front lines again.",
        "nextObjective": "The arrival of V and the Johnny Silverhand engram in 2077 is the inciting incident that breaches her fortress. Her objective is forced to shift from maintaining the status quo to confronting the ghost she has spent a lifetime burying. The war is no longer against outside forces; it is against herself."
      }
    },
    "legendaryArsenal": {
      "rumor": "The Queen of Fixers has little need for personal weapons, but the Solo of Legend never truly died. Rogue is said to keep relics from her past, personal and iconic tools that represent the two halves of her life: the warrior she was and the queen she became.",
      "weapons": [
        {
          "name": "Pride",
          "description": "Rogue's personal Malorian Arms 3516, a sister weapon to Johnny's. It has not been fired in decades. Kept in a biometric case in her private quarters, it is a museum piece, a reminder of the legendary solo she once was. To even see the weapon is to be told a secret that could get you killed."
        },
        {
          "name": "The Oracle",
          "description": "Not a weapon, but the source of her true power. A custom, pre-Blackwall mainframe located in a shielded sub-level of the Afterlife. It is her personal, isolated intelligence network, the heart of her information empire. The Oracle is the most valuable piece of hardware in Night City, and Rogue is the only one with the key."
        }
      ]
    },
    "eliteOperatives": {
      "overview": "Rogue's 'crew' is a global network of the best mercenaries, informants, and specialists alive. However, she maintains a small, hyper-elite inner circle who handle her most sensitive personal and business affairs. They are not her friends; they are the pillars of her throne.",
      "operatives": [
        {
          "alias": "'Weyland' (The Hand)",
          "specialization": "Security, Wetwork, Enforcement",
          "profile": "The current head of security for the Afterlife and Rogue's personal enforcer. A calm, professional, and terrifyingly efficient solo who rose through the ranks to earn her trust. He is the physical manifestation of Rogue's will, the one she sends when a message needs to be delivered personally and lethally.",
          "relationship": "Strictly professional. Weyland serves Rogue with absolute loyalty born of respect and fear. Rogue sees him as the best tool for a job she no longer does herself.",
          "roleInTheShadowWar": "Weyland's primary role is to protect the queen and her castle. He is the gatekeeper, the guardian of her physical security, and the one tasked with eliminating any direct threats to her operations before they can even begin."
        },
        {
          "alias": "'Nix' (The Keeper of Secrets)",
          "specialization": "Netrunning, Information Brokerage, Data Security",
          "profile": "One of the few old-school netrunners who survived the Blackwall, Nix is the master of the Afterlife's digital domain. He manages the constant flow of data for Rogue, filters the intel, and maintains the security of 'The Oracle.' He is the high priest of her information cult.",
          "relationship": "A symbiotic partnership built on decades of mutual trust. Nix is one of the very few people Rogue treats as a near-equal, respecting his mastery of a domain she no longer has time to command personally.",
          "roleInTheShadowWar": "Nix's role is to ensure Rogue's primary weapon—information—is always sharp and always secure. He fights a constant, invisible war against rival netrunners and corporate spies who would kill to get a glimpse of Rogue's data."
        }
      ]
    },
    "legendaryGigs": [
      {
        "gigTitle": "The Coronation",
        "date": "Circa 2045",
        "objective": "Simultaneously neutralize the three rival fixers who controlled the Night City underworld after the 4th Corporate War, consolidating their networks under her control in a single night.",
        "client": "Self-Initiated",
        "target": "The Old Guard of Fixers (Silas 'The Rat' Grier, Eva 'Mama' Rostova, and 'Mr. Stone')",
        "outcome": "A silent, brutal masterpiece of efficiency. Using three separate, unaware merc teams, she digitally isolated, framed, and eliminated her rivals in a single night. By sunrise, the old guard was gone, and their bewildered crews found themselves with only one person to turn to: Rogue.",
        "hiredMercs": "Three independent, anonymous elite crews. The solo was rumored to be Morgan Blackhand, a story Rogue never confirmed or denied.",
        "mercFeedback": "'The contract was simple: isolate a target's network for one hour. The pay was astronomical. We didn't know until the next day that we'd helped kill a king. Rogue didn't just take the throne; she made the old kings vanish and then sold their crowns back to their own people. Cold.' - Attributed to an anonymous netrunner.",
        "payout": "Total control of Night City's fixer underworld.",
        "reputationImpact": "This was the gig that cemented Rogue's status as the Queen of the Afterlife. It was a statement of intent: the chaotic, passionate era of Johnny Silverhand was over, and the cold, professional, ruthlessly efficient reign of Rogue Amendiares had begun."
      },
      {
        "gigTitle": "The Orbital Air Coup",
        "date": "Circa 2065",
        "objective": "Orchestrate the hostile takeover of the aerospace giant Orbital Air by manipulating global markets and systematically dismantling its board of directors from the shadows.",
        "client": "Anonymous Pan-European Consortium",
        "target": "The corporate sovereignty of Orbital Air.",
        "outcome": "A flawless, bloodless corporate assassination. Over three days, Rogue's network initiated a cascading failure: a netrunner team crashed their stock value with targeted data leaks, a solo team acquired blackmail material on key board members to force their resignations, and her media contacts flooded the news with negative press. The client consortium acquired the crippled company for a pittance.",
        "hiredMercs": "'The Syndicate' (A legendary, now-disbanded crew of specialists).",
        "mercFeedback": "'We never saw Rogue. We just got our orders on a shard. My team was tasked with one thing: retrieve a data cache from a penthouse in Geneva. We didn't know that at the same time, another crew was hitting a server farm in Tokyo. It was only when we saw the news a week later that we realized we hadn't just done a gig; we had helped topple a kingdom. That's Rogue's level.' - Attributed to a former Syndicate member.",
        "payout": "Undisclosed percentage of the acquisition. Estimated to be over €$ 10,000,000.",
        "reputationImpact": "If 'The Coronation' was her coronation in Night City, this was her ascension to the global stage. It proved that her power was not limited to the street, and that she could wage war on a scale even corporations had to fear. She was no longer just the Queen of the Afterlife; she was one of the most powerful private intelligence brokers in the world."
      }
    ],
    "mostFamousGig": {
      "gigTitle": "Assault on Arasaka Tower (2023)",
      "date": "08.20.2023",
      "objective": "Infiltrate Arasaka Tower with Johnny Silverhand's team to plant a mini-nuke, ostensibly to destroy the corporate headquarters and liberate Alt Cunningham from the company's subnet.",
      "client": "Militech (unofficially, via Johnny Silverhand)",
      "target": "Arasaka Tower & The Arasaka Subnet",
      "outcome": "A legendary catastrophe. While the nuke detonated, destroying the tower and triggering the 4th Corporate War, the primary objective failed. Johnny Silverhand was killed by Adam Smasher, and Alt Cunningham was lost to the Net. Rogue was one of the few survivors, escaping with the trauma and cynicism that would define the next fifty years of her life.",
      "mercFeedback": "'We went in to burn down the world and save a ghost. The world burned, alright. But the ghost got away, and it took Johnny with it. We failed. I survived. Some days, I'm not sure which is worse.' - Rogue Amendiares (internal monologue).",
      "reputationImpact": "This is the single most famous event in modern Night City history. Rogue's survival and role in the op cemented her status as a living legend. However, its failure and the loss of Johnny became the crucible that burned away her idealism, forging the cold, pragmatic fixer who would one day rule the city she and Johnny tried to burn."
    },
    "fixerRatings": {
      "overallThreat": "10/10 (Legendary)",
      "reliability": "10/10 - An ironclad contract. Her word is unbreakable, but her loyalty is to the mission, not the merc.",
      "payment": "10/10 - The highest in Night City, period. She deals in fortunes worthy of the legendary risks her jobs entail.",
      "intelQuality": "10/10 - Flawless. Her information network is the most sophisticated and far-reaching in the world.",
      "discretion": "10/10 - Absolute. The secrets of gods and kings pass through her, and the vault has never been breached.",
      "resourcefulness": "10/10 - If it can be bought, stolen, or built, Rogue can acquire it.",
      "mercSurvivability": "7/10 - Her intel is flawless, but she sends her mercs into the heart of the storm. Her jobs are the most dangerous in the world, and only the absolute best have a chance of walking away."
    },
    "advantages": {
      "strengths": [
        "Access to the most lucrative and impactful jobs in the world.",
        "An unparalleled global intelligence network.",
        "A legendary reputation that can open any door and intimidate any rival.",
        "Commands the respect and fear of every major faction in Night City."
      ],
      "weaknesses": [
        "Emotionally detached and ruthlessly pragmatic.",
        "Zero tolerance for failure or unprofessionalism.",
        "Her jobs carry the highest possible risk of death or corporate retaliation.",
        "Deals are purely transactional; she offers no personal loyalty (pre-2077)."
      ]
    },
    "recentGigDetails": [
      {
        "gigTitle": "Chippin' In",
        "date": "Late 2077",
        "objective": "A ghost from the past wants to settle a score. At the urging of the Johnny Silverhand engram, help Rogue hunt down intel on the location of Adam Smasher.",
        "client": "Johnny Silverhand (via V)",
        "target": "Adam Smasher",
        "outcome": "Successful. This was no ordinary gig. Rogue leveraged her entire network not for eddies, but for a ghost. The intel was secured, but the operation was a raw, personal affair that saw the Queen of the Afterlife step back into the role of a solo on a mission of revenge.",
        "mercFeedback": "'This wasn't business. This was personal. For the first time, I saw the Rogue that Johnny knew—the legend, not the fixer. She's still the best there ever was.' - 'V' (Mercenary)",
        "payout": "Personal Debt / Alliance"
      },
      {
        "gigTitle": "Blistering Love",
        "date": "Late 2077",
        "objective": "Fulfill an old promise. Take Rogue on a 'date' to the Silver Screen Drive-In, a ghost of a place for a ghost of a memory, as a final farewell to Johnny Silverhand.",
        "client": "Johnny Silverhand (via V)",
        "target": "A night out.",
        "outcome": "Successful. A surreal and personal mission that had nothing to do with contracts or combat. Rogue confronted the ghost of her past, sharing a moment of vulnerability and closure under the flickering screen before returning to her throne. The event solidified a complex and powerful alliance, transforming a business relationship into something more.",
        "mercFeedback": "'She's the Queen for a reason. Even when she's off the clock, she's still five steps ahead. It wasn't about the movie; it was about closing a fifty-year-old wound. There's more to her than just the Afterlife.' - 'V' (Mercenary)",
        "payout": "Trust & Partnership"
      },
      {
        "gigTitle": "(Don't) Fear the Reaper",
        "date": "Late 2077",
        "objective": "The ultimate gig: assault Arasaka Tower. With Johnny's engram and Rogue at your side, lead a legendary charge against the most powerful corporation on Earth.",
        "client": "Self-Initiated (Atonement)",
        "target": "Arasaka Tower / Mikoshi / Adam Smasher",
        "outcome": "Legendary, but costly. With Rogue providing tactical command and fighting on the front lines, the team launched a full-scale assault. It was a blaze of glory that echoed the original 2023 attack. Rogue, the ultimate survivor, finally confronted her past and Adam Smasher, paying the ultimate price to see the mission through. She went out not as a fixer, but as the solo she always was.",
        "mercFeedback": "'She went out on her own terms, in a storm of fire and lead, just like a legend should. She wasn't just my fixer; in the end, she was my choom. She gave everything to finish what she and Johnny started.' - 'V' (Mercenary)",
        "payout": "A Legend's Legacy"
      }
    ]
  }
}