{
  "weaponProfile": {
    "title": "Dead-Stop",
    "image": "/anchor.png",
    "id": "militech_anchor_legendary",
    "aliases": ["The Holdout", "Bastion's Vow", "The Line"],
    "type": "Power Revolver",
    "manufacturer": "Militech (Custom Masterwork)",
    "status": "Unique; Hero's Relic",
    "cost": "Priceless (A Symbol of Valor)",
    "specialAbility": "Recoil is significantly reduced and accuracy is massively increased after standing still for 1.1 seconds. The first shot fired after this effect is active is a guaranteed critical hit that applies a powerful knockdown effect. Headshot kills with this first shot will ricochet to a second nearby enemy.",
    "baseStats": {
      "attackSpeed": 1.8,
      "damage": "500",
      "reloadSpeed": 2.5,
      "range": 60,
      "mods": 2
    },
    "keyRelationships": {
      "nemesis": "Commander Ryota Takahashi (Arasaka | Disgraced). Takahashi was the brilliant young Arasaka commander whose entire elite squad was systematically dismantled by Sgt. Miller during the 'Siege of the 7th Hell.' He was out-sniped, out-maneuvered, and publicly humiliated by a single soldier with a revolver. Now a bitter, demoted officer in a dead-end post, he is obsessively dedicated to finding 'Dead-Stop,' believing that defeating its wielder in a duel is the only way to erase his shame and reclaim his lost honor.",
      "creator": "Militech R&D (Urban Warfare Division)"
    },
    "legendaryOrigin": {
        "gigTitle": "The Siege of the 7th Hell",
        "date": "02.11.2074",
        "objective": "During a corporate skirmish, Militech Sergeant 'Bastion' Miller and his squad were cut off and pinned down on the 7th floor of a half-constructed skyscraper by a superior Arasaka force led by Commander Takahashi.",
        "client": "Militech (Emergency Defense)",
        "target": "The Arasaka Assault Squad",
        "outcome": "A legendary last stand that became required viewing at the Militech academy. Miller, armed with his custom-tuned Anchor, 'Dead-Stop,' held the central stairwell alone for over an hour, covering his squad's retreat. Using the long sightlines, he systematically eliminated Takahashi's elite soldiers one by one with perfectly placed, guaranteed critical shots every time they broke cover. He fell, but not before his squad escaped and reinforcements arrived. The Arasaka operation was a catastrophic failure.",
        "mercFate": "Sergeant 'Bastion' Miller was posthumously awarded Militech's highest honor. He became a legend, a symbol of the 'hold the line' doctrine.",
        "mercFeedback": "'The helmet cams are unbelievable. It's just Miller, braced behind a pillar. He doesn't move. Doesn't flinch. Just *BAM*... Arasaka down. Wait. *BAM*... another one. He held off an entire elite squad with a revolver. He didn't just win the fight; he broke their will. Takahashi wasn't defeated; he was dismantled, piece by piece.' - Militech training academy analysis.",
        "payout": "The survival of Miller's squad and a major tactical victory.",
        "reputationImpact": "This event turned 'Dead-Stop' into a legendary weapon, a symbol of Militech's grit and a soldier's ultimate sacrifice. It became a holy relic within the military community. It also created a bitter, lifelong enemy in Commander Takahashi, a man whose brilliant career was single-handedly destroyed by this very gun."
    },
    "designAndMaterials": {
        "materials": "The frame is a master-crafted piece of forged tungsten steel, significantly heavier than the standard model, bearing the engraved name of Sgt. 'Bastion' Miller. The barrel is a custom, ported heavy barrel. The GRN housing is adorned with the Militech 7th Cavalry insignia. The grip is worn synth-leather, molded perfectly to a two-handed hold.",
        "ammunitionType": "Chambered for the Militech .45 'Dead-Stop' round. This specific weapon is calibrated to handle an experimental 'heavy grain' version of the round, providing a more powerful knockdown effect than the standard-issue variant.",
        "compatibleMods": [
            { "slot": "Optics", "mod": "Militech 'Hawkeye' Hybrid Scope", "description": "A 2x-4x variable zoom scope that links to the GRN. When stabilization is active, the scope highlights enemy weak points." },
            { "slot": "Internal", "mod": "Miller's Calibrated GRN", "description": "This unique, master-crafted gyroscopic system is the heart of the weapon. It activates faster (1.1s) and provides a more stable platform than any commercial Anchor, enabling the powerful knockdown and ricochet effects." }
        ]
    },
     "weaponPhilosophy": {
      "concept": "The Anchor is the embodiment of Militech's defensive doctrine: 'Hold the line at all costs.' It was designed for the patient killer who understands that the best position is a fortified one. Its philosophy rejects the chaotic dance of run-and-gun combat in favor of absolute certainty. The activation delay is not a flaw; it is a feature that forces discipline. It teaches the user to control the battlefield through superior positioning and to make every shot a decisive, final statement. It is a tool for executing from a position of absolute power."
    },
    "manufacturingIntel": {
      "creatorReputation": "The Anchor was designed by a team of ex-NUSA combat engineers. 'Dead-Stop' was the personal sidearm of Sergeant 'Bastion' Miller, a custom-tuned prototype he received for valor directly from the R&D division.",
      "developmentHistory": "'Dead-Stop' is the one-of-a-kind prototype that proved the Anchor's potential. After Miller's legendary last stand, Militech used the weapon's fame to promote the mass-produced version to their troops. The commercial models are effective, but they lack the custom calibration, faster GRN, and legendary history of the original.",
      "productionDate": "Circa 2073"
    },
    "tacticalAssessment": {
      "strengths": [
        "Incredible accuracy and stopping power when fired from a stationary position.",
        "The guaranteed critical hit and knockdown allows for devastating opening shots or ambushes.",
        "Functions as a pocket sniper rifle, capable of picking off targets at medium-to-long range.",
        "The ricochet effect on headshot kills provides a surprise multi-kill potential."
      ],
      "weaknesses": [
        "The special ability is completely useless for a mobile, run-and-gun playstyle.",
        "Has significant recoil and poor accuracy when fired on the move.",
        "Slower rate of fire compared to other top-tier revolvers.",
        "Possession of this weapon makes you the personal rival of the disgraced Arasaka commander, Ryota Takahashi."
      ],
      "recommendedRoles": "Designated Marksman, Sniper, Sentry, Tactical Operator.",
      "masteryArchetype": "A 'Castle' build. A solo with a high Cool and Body attribute who treats combat like a fortress defense. The ideal user finds a defensible position, sets up with a primary weapon, and uses 'Dead-Stop' to eliminate any mid-range threats that breach their perimeter. They are a patient, methodical killer who controls the battlefield through superior positioning and flawless aim."
    },
    "acquisitionIntel": {
      "marketAvailability": "Unique. 'Dead-Stop' is a piece of Militech history and is not for sale.",
      "rumoredLocation": "After Sgt. Miller's death, the weapon was supposed to be enshrined at the Militech academy. However, it was stolen from the memorial. Rumors suggest a 6th Street veteran, who was part of the squad that reinforced Miller, took it, believing a hero's gun should be in the hands of a soldier, not behind glass. The prize for an underground sharpshooting competition in the Badlands is said to be this very weapon, a contest designed to find a shooter worthy of Miller's legacy."
    },
    "fieldTestimonials": [
      
    ],
    "crewSynergyAssessment": {
      "analysis": "Dead-Stop is a specialized but incredibly powerful asset for a crew that values tactical positioning. Its ideal user is the team's dedicated marksman or heavy gunner—the one who establishes a 'nest' and provides overwatch. In a defensive scenario, the Dead-Stop user becomes the lynchpin of the operation, capable of locking down an entire corridor with perfectly accurate, high-damage shots. It synergizes perfectly with a crew that can control the flow of battle and funnel enemies into pre-determined kill zones, allowing the wielder to methodically execute targets from a position of safety and power."
    }
  }
}