{
  "weaponProfile": {
    "title": "The Scream",
    "image": "/banshee.png",
    "id": "zetatech_banshee_prototype_01",
    "aliases": ["The Ghost Note", "The Glass Shatterer", "The Silent Scream"],
    "type": "Tech Pistol",
    "manufacturer": "Zetatech (Non-Lethal Solutions Division)",
    "status": "Unique Prototype; Blacklisted",
    "cost": "€$115,000 (Black Market Estimate)",
    "specialAbility": "A fully charged shot releases a wide, conical sonic blast that deafens and stuns enemies, disabling their special abilities and scrambling their optics. Enemies affected by the blast become vulnerable to a unique 'Shatter' quickhack, which causes their cyberware to violently explode.",
    "baseStats": {
      "attackSpeed": 3,
      "damage": "50 (+Sonic)",
      "reloadSpeed": 1.5,
      "range": 25,
      "mods": 2
    },
    "keyRelationships": {
      "nemesis": "Commander Kaito Ishikawa (Arasaka | Disgraced). Ishikawa was the decorated security commander in charge of protecting the 'Soulfire' data during the heist. 'The Scream' was used to neutralize his entire elite squad without a single casualty, making him a laughingstock in Arasaka's honor-bound culture. He was demoted to a dead-end patrol in the industrial district. He is now a broken man, obsessed with finding the weapon that destroyed his career, believing that its recovery is the only way to restore his honor.",
      "creator": "Zetatech Non-Lethal Solutions Division"
    },
    "legendaryOrigin": {
        "gigTitle": "The Sound of Silence",
        "date": "11.08.2075",
        "objective": "Infiltrate a heavily fortified Arasaka data fortress and steal the R&D data for 'Project Soulfire,' a next-generation Black ICE. The client's one condition: zero casualties, zero collateral damage.",
        "client": "Mr. Hands (on behalf of an unknown party)",
        "target": "'Project Soulfire' R&D Data",
        "outcome": "A legendary, bloodless coup. Mr. Hands' chosen operative, a netrunner-solo hybrid known as 'Echo,' was given the sole Banshee prototype, 'The Scream.' 'Echo' infiltrated the facility and reached the server room, but was cornered by Commander Ishikawa and his elite cyborg guard. Instead of a firefight, 'Echo' used a single charged blast from 'The Scream.' The sonic wave instantly disabled the entire squad, rebooting their optics and cyberware. 'Echo' downloaded the data and walked past the stunned, helpless guards. The heist was so clean, so perfect, Arasaka classified it to avoid the corporate humiliation.",
        "mercFate": "The netrunner 'Echo' was paid a fortune and became one of Mr. Hands' most trusted, high-value assets for operations requiring absolute subtlety. The weapon, 'The Scream,' was part of her payment.",
        "mercFeedback": "'The Arasaka guards were monsters, full military chrome. A real firefight would have been a bloodbath. But this... this wasn't a fight. It was a system reboot. One *thrum*, and a dozen of Arasaka's finest were just blind, deaf, twitching statues. I didn't beat them; I just turned them off. It's the most terrifyingly elegant weapon I've ever seen.' - Decrypted comms log from 'Echo'.",
        "payout": "A priceless piece of Black ICE R&D.",
        "reputationImpact": "This event became a ghost story in the world of corporate espionage, the ultimate example of a 'perfect' heist. It cemented the Banshee's reputation as the ultimate tool for non-lethal operations and turned 'The Scream' into a legendary artifact. It also created a vengeful, disgraced Arasaka officer who now hunts the weapon that is the source of his shame."
    },
    "designAndMaterials": {
        "materials": "The chassis of 'The Scream' is an advanced, sound-absorbent polymer not used in the commercial models, making it even quieter to the user. The core is a set of perfectly resonant, lab-grown piezoelectric crystals. The flared muzzle is a custom-tuned acoustic waveguide, designed to carry the unique 'Shatter' quickhack frequency within the main sonic wave.",
        "ammunitionType": "The Banshee uses no projectile ammunition. It is powered by a proprietary Zetatech high-density charge pack. 'The Scream's' prototype power cell is overclocked, allowing it to generate the specific, complex waveform that renders targets vulnerable to the 'Shatter' quickhack, a feature that was deemed too unstable for the mass-produced models.",
        "compatibleMods": [
            { "slot": "Internal", "mod": "Echo's Resonance Engine", "description": "This unique, non-replicable modification is the heart of the weapon. It contains the software for the 'Shatter' quickhack and a more efficient capacitor, allowing for faster charge times and a more potent stun effect." },
            { "slot": "Muzzle", "mod": "Harmonic Amplifier", "description": "Widens the cone of the charged sonic blast, allowing it to affect a larger group of enemies at the cost of a slight reduction in range." }
        ]
    },
     "weaponPhilosophy": {
      "concept": "The Banshee embodies Zetatech's core principle of 'Control, Don't Destroy.' In a world where a single stray bullet can obliterate millions of eddies worth of server data or kill a priceless extraction target, lethal force is a liability. The Banshee is the solution. It is a weapon of systemic disruption, designed not to end a life, but to temporarily erase a target's ability to function. Its philosophy is surgical and clean: overwhelm their senses, crash their cyberware, and neutralize the threat before a single drop of blood is shed."
    },
    "manufacturingIntel": {
      "creatorReputation": "Zetatech's Non-Lethal division is known for creating the most advanced crowd control technology on the market. Their philosophy is 'asset preservation,' believing it's more profitable to incapacitate a threat than to destroy it.",
      "developmentHistory": "'The Scream' is the one-of-a-kind prototype that proved the Banshee concept. After its legendary success in 'The Sound of Silence' heist, Zetatech used the data to create the less powerful, more stable commercial models for their corporate clients. The unique and dangerous 'Shatter' quickhack was removed from the production version, making 'The Scream' a truly unique and powerful artifact.",
      "productionDate": "Circa 2075"
    },
    "tacticalAssessment": {
      "strengths": [
        "Superb non-lethal crowd control, capable of stunning entire groups in a single blast.",
        "The unique 'Shatter' quickhack provides a devastating lethal option against stunned, high-threat targets.",
        "Completely silent until the moment of impact, allowing for surprise attacks.",
        "Zero collateral damage to the environment, making it ideal for hostage or data protection gigs."
      ],
      "weaknesses": [
        "Extremely low lethal damage without the use of the 'Shatter' quickhack.",
        "The sonic pulse has a short range and cannot penetrate cover.",
        "The charge-up time for the conical blast requires pre-meditation.",
        "Possession of this weapon will make you the primary target of the disgraced Arasaka commander, Kaito Ishikawa."
      ],
      "recommendedRoles": "Riot Control, Corporate Security, Non-Lethal Infiltrator, Support, Netrunner-Hybrid.",
      "masteryArchetype": "A 'Field Controller' build. A merc with a high Cool and Intelligence attribute who focuses on managing the battlefield. The ideal user combines 'The Scream' with non-lethal quickhacks. They don't eliminate threats; they disable them, controlling the flow of combat and creating openings for their squad, reserving the deadly 'Shatter' quickhack for only the most dangerous, unavoidable threats."
    },
    "acquisitionIntel": {
      "marketAvailability": "Unique. This weapon is a corporate legend and cannot be bought.",
      "rumoredLocation": "After the legendary netrunner 'Echo' used it to complete several high-profile gigs for Mr. Hands, the weapon vanished. Some say she still carries it, operating in the deepest shadows of the corporate world. Others claim she traded it to a high-ranking Voodoo Boy in exchange for safe passage through the Blackwall. The most persistent rumor is that a crate of Maelstrom gangers stumbled upon it and, unaware of its true nature, now use it as a noisemaker in their drug-fueled raves at the All Foods plant."
    },
    "fieldTestimonials": [
      
    ],
    "crewSynergyAssessment": {
      "analysis": "The Scream is a quintessential support weapon that can define a crew's effectiveness in non-lethal and control-based operations. It is best wielded by the crew's Netrunner or a dedicated 'Controller' merc. Their role is to initiate combat by disabling the most dangerous threats in a room, allowing the crew's solo or melee specialist to move in and perform takedowns. The added 'Shatter' quickhack provides a crucial lethal option for 'oh shit' moments, allowing the controller to instantly eliminate a high-threat target that resists the initial stun. In a crew built for stealth and subtlety, The Scream is the ultimate insurance policy for when things go loud."
    }
  }
}