{
  "weaponProfile": {
    "title": "Glitch",
    "image": "/glitch.jpg",
    "id": "tetratronic_glitch",
    "aliases": ["The ICEbreaker", "System Crash", "Decker's Delight"],
    "type": "Smart Shotgun",
    "manufacturer": "Tetratronic",
    "status": "Active; Specialist Issue",
    "cost": "€$120,000 (Black Market Estimate)",
    "specialAbility": "Projectiles deal low physical damage but high EMP damage, disabling enemy cyberware and stunning robotic foes. A charged shot can reboot an enemy's optics.",

    "baseStats": {
      "attackSpeed": 1.5,
      "damage": "90 (+EMP)",
      "reloadSpeed": 3,
      "range": 20,
      "mods": 2
    },

    "manufacturingIntel": {
      "creator": "Tetratronic Advanced Systems (Cyberwarfare Division)",
      "creatorReputation": "Tetratronic is a leading manufacturer of high-end cyberdecks and netrunning software. The 'Glitch' project was a radical departure for them, an attempt to bridge the gap between virtual and physical warfare. The design team, led by a former Netwatch agent, focused on creating a weapon that a netrunner could use for self-defense without breaking their non-lethal ethos.",
      "developmentHistory": "The 'Glitch' was developed as a less-lethal alternative for corporate security and netrunners who needed a way to deal with physical threats without resorting to lethal force. The core innovation is its 'data-packet' shell, which fragments on impact into a cloud of micro-projectors that emit a targeted, high-intensity EMP burst. This scrambles cyberware and fries robotic systems. The project was a commercial success among high-end netrunners and corporate security firms who valued asset preservation over termination.",
      "productionDate": "Circa 2076"
    },

    "tacticalAssessment": {
      "strengths": [
        "Extremely effective against heavily chromed enemies, cyberpsychos, and robotic units.",
        "Provides excellent non-lethal crowd control, stunning multiple targets at once.",
        "The ability to reboot enemy optics can create a crucial opening for escape or a follow-up attack.",
        "As a Smart Weapon, it ensures that the data-packets hit their mark."
      ],
      "weaknesses": [
        "Almost completely ineffective against unaugmented or minimally-chromed targets.",
        "Very low physical damage means it cannot penetrate cover or damage the environment.",
        "The unique ammunition is expensive and can only be purchased from specialized vendors.",
        "Slower rate of fire and reload speed compared to conventional shotguns."
      ],
      "recommendedRoles": "Netrunner, Techie, Non-lethal Operative, Corporate Security.",
      "masteryArchetype": "A 'System Shock' build. A netrunner with a high Intelligence attribute who uses quickhacks to weaken enemies from a distance before moving in with the Glitch to disable them completely. The ideal user treats combat like a puzzle, using the shotgun not to kill, but to create openings for a final, decisive hack or a non-lethal takedown."
    },

    "acquisitionIntel": {
      "marketAvailability": "Rare. The Glitch is a specialized, high-end piece of hardware. It can be found at Tetratronic-affiliated weapon vendors in City Center or as a potential reward from fixers who deal in high-tech solutions, like Dino Dinovic or Mr. Hands.",
      "rumoredLocation": "Intel suggests that a shipment of Glitch shotguns was recently delivered to the Netwatch regional headquarters in Corpo Plaza. A few units have reportedly 'gone missing' from the armory, likely finding their way onto the black market through a corrupt agent."
    },

    "fieldTestimonials": [
      {
        "merc": "'Static' (Netrunner)",
        "context": "Escaping a compromised data heist in an Arasaka facility.",
        "feedback": "'This thing saved my life. I was cornered by two Arasaka cyborgs, full-on chrome monsters. One blast from the Glitch and they both seized up, sparking like broken toys. Didn't kill 'em, just turned 'em off. Gave me the window I needed to get to the access point. It's the perfect gun for people who'd rather not use a gun.'",
        "rating": "5/5"
      },
      {
        "merc": "'Juggernaut' (Brawler)",
        "context": "Street brawl against the Valentinos.",
        "feedback": "'It's a toy. A fancy, expensive toy. I shot a V-boy point-blank and he just stumbled back and laughed at me. This thing tickles anyone who isn't 90% metal. Useless. Give me a real shotgun that makes a real hole.'",
        "rating": "1/5 (Against flesh)"
      },
      {
        "merc": "'Regina Jones' (Fixer)",
        "context": "Reviewing gear for her anti-cyberpsycho operations.",
        "feedback": "'The Glitch has proven to be an invaluable tool. Its ability to disable a cyberpsycho's combat chrome without causing significant physical trauma is revolutionary. It allows my mercs to neutralize the target with a much lower risk of fatality. A truly remarkable piece of non-lethal engineering.'",
        "rating": "4/5 (Specialized Tool)"
      }
    ]
  }
}