{
  "weaponProfile": {
    "title": "Kabuki-yaki",
    "image": "/oni.png",
    "id": "tyger_claws_onis_breath_legendary",
    "aliases": ["The Dragon's Roar", "The Hell's Bouncer", "The Scorched Grin"],
    "type": "Power Shotgun",
    "manufacturer": "Tyger Claws (Cursed Masterwork)",
    "status": "Unique; Heretical Artifact",
    "cost": "€$100,000 (Black Market Estimate)",
    "specialAbility": "Fires a tight spread of incendiary pellets that deal high Thermal damage. Defeating an enemy with this weapon causes them to explode in a massive fireball. Kills on burning enemies have a chance to upload the 'Cyberpsychosis' quickhack to a nearby enemy.",
    "baseStats": {
      "attackSpeed": 2,
      "damage": "180 (+Thermal)",
      "reloadSpeed": 2.8,
      "range": 15,
      "mods": 2
    },
    "keyRelationships": {
      "nemesis": "Jötunn 'The Ash-Faced' (Maelstrom | Fire-Prophet). Jötunn was a Maelstrom heavy who was the sole survivor of the 'Dock 12 Inferno.' He was caught in the blast of the Kabuki-yaki's first kill, which didn't just burn him; the weapon's chaotic data-curse uploaded a permanent, low-level 'Overheat' daemon into his optics. He is now a fire-obsessed cyberpsycho who sees the world in thermal vision and believes the shotgun 'blessed' him. He is fanatically obsessed with reclaiming the weapon, not to use it, but to worship it as the avatar of his fiery god.",
      "creator": "The Hiromi Sato Dojo (Disgraced Bladesmith)"
    },
    "legendaryOrigin": {
        "gigTitle": "The Dishonored Smith",
        "date": "Circa 2074",
        "objective": "A young, ambitious Tyger Claw bladesmith, spurned for his obsession with firearms over blades, sought to forge a gun with the 'soul' of a katana. He planned to present his masterpiece, the Kabuki-yaki, to the Tyger Claw elders to prove his worth.",
        "client": "Self-Initiated (A Bid for Honor)",
        "target": "The approval of the Tyger Claw elders.",
        "outcome": "A catastrophic success and a legendary curse. The bladesmith embedded the shotgun with a data shard containing the combat data of a legendary, but dishonorable, Tyger Claw warrior who was known for his brutality. During the forging ritual, a Maelstrom raid hit the docks. The smith, in a desperate act, used the freshly consecrated weapon. The first kill triggered a massive, unexpected explosion that incinerated the entire Maelstrom crew, except for one. The explosion also killed the smith. The weapon, now believed to be haunted by the dishonored warrior's vengeful spirit, was recovered by Wakako's agents.",
        "mercFate": "N/A. The bladesmith was killed by his own creation. The sole Maelstrom survivor, Jötunn, was driven mad by the supernatural fire, becoming a cyberpsycho.",
        "mercFeedback": "'The kid was a genius, but a heretic. He tried to put the soul of a warrior into a gun. He succeeded. The problem is, the warrior he chose was a monster. The gun doesn't just burn; it hates. It carries the rage of a man who died in dishonor. It is a powerful, beautiful, and utterly cursed object.' - Wakako Okada.",
        "payout": "The creation of a cursed legend.",
        "reputationImpact": "The event turned the 'Kabuki-yaki' into a forbidden weapon. Traditionalist Tyger Claws see it as an abomination, a perversion of their code. More pragmatic members see it as a terrifyingly powerful tool. Its creation cemented the belief that some weapons can have a soul, but it also unleashed a new and unpredictable cyberpsycho, Jötunn, who is psychically and spiritually bound to the weapon's violent history."
    },
    "designAndMaterials": {
        "materials": "The weapon is built on a heavily modified Rostović DB-2 Satara chassis. The barrels are hand-forged from folded steel, a technique usually reserved for katanas, and are adorned with a fearsome, hand-painted Oni mask that seems to sneer. The stock is lacquered wood, inlaid with the data shard containing the combat data of the dishonored warrior.",
        "ammunitionType": "Uses custom-loaded incendiary shells. Each pellet is coated in a proprietary chemical that burns at an extremely high temperature. The data shard in the stock is the source of the weapon's 'curse,' using the bio-feedback from a kill to generate a chaotic data-surge that has a chance to overload a nearby enemy's neuralware, triggering a psycho-break.",
        "compatibleMods": [
            { "slot": "Muzzle", "mod": "Oni's Grin Muzzle", "description": "A custom, serrated muzzle brake that shapes the blast into a tighter cone, increasing effective range and the intensity of the Burn effect." },
            { "slot": "Internal", "mod": "The Vengeful Spirit Shard", "description": "This unique, cursed data shard is the heart of the weapon. It is the source of the powerful corpse-explosion and the Cyberpsychosis quickhack, but it also causes minor, unsettling visual glitches in the user's optics." }
        ]
    },
     "weaponPhilosophy": {
      "concept": "The Oni's Breath was designed as an instrument of psychological warfare. Its philosophy is not just to kill, but to make a statement of terrifying, overwhelming force. The brilliant flash, the roar of the fire, and the sight of a comrade exploding into a secondary fireball are all calculated to break an enemy's will to fight. It is a weapon that embodies the concept of 'dishonorable combat'—chaotic, terrifying, and utterly without mercy. It is the fury of a demon given physical form."
    },
    "manufacturingIntel": {
      "creatorReputation": "While known for their katanas, the Tyger Claw masters also create firearms they deem worthy. The Kabuki-yaki was the secret, heretical project of a single, disgraced smith.",
      "developmentHistory": "'Kabuki-yaki' is a one-of-a-kind, cursed artifact. After its creator's death and the disastrous first firing, the Tyger Claw elders forbade any further attempts to merge a 'warrior's soul' with a firearm. The other Oni's Breath shotguns are merely high-quality incendiary weapons, lacking the explosive power and the dangerous, sentient rage of the original.",
      "productionDate": "Circa 2074"
    },
    "tacticalAssessment": {
      "strengths": [
        "Exceptional for crowd control, as the corpse-explosion can chain-react in dense groups of enemies.",
        "The chance to trigger 'Cyberpsychosis' can instantly turn the tide of a battle.",
        "High Thermal damage is devastating against unarmored targets and can cause panic.",
        "A visually and audibly intimidating weapon that can break enemy morale."
      ],
      "weaknesses": [
        "The corpse-explosion is unpredictable and can cause massive self-inflicted damage.",
        "The 'Cyberpsychosis' effect is a double-edged sword that can create a new, uncontrollable threat.",
        "Ineffective against heavily armored or robotic enemies resistant to fire.",
        "Possession of this weapon will make you the primary target of the fire-worshipping cyberpsycho, Jötunn."
      ],
      "recommendedRoles": "Breacher, Crowd Control, Pyromaniac, Chaos Agent.",
      "masteryArchetype": "An 'Oni' build. A merc with a high Body attribute and cyberware that grants immunity to Thermal damage. The ideal user is an aggressive, close-quarters combatant who charges into the heart of the enemy, using the shotgun to create fiery chain reactions. They thrive in chaos, turning the battlefield into an inferno that they can walk through unharmed. They don't just clear a room; they purify it with fire."
    },
    "acquisitionIntel": {
      "marketAvailability": "Unique. This weapon is a cursed relic and a symbol of a great shame. It cannot be bought.",
      "rumoredLocation": "After the 'Dock 12 Inferno,' the weapon was recovered by Wakako Okada's agents. She sees it as a dangerous but potentially useful tool. She keeps it locked away in a secure vault, believing its chaotic spirit is too unpredictable for a standard operative. She would only consider parting with it as a final, desperate reward for a merc who has solved an impossible problem for her, a problem that requires a chaotic, fiery solution."
    },
    "fieldTestimonials": [
      
    ],
    "crewSynergyAssessment": {
        "analysis": "The Kabuki-yaki is the ultimate agent of chaos for a crew that isn't afraid to get their hands dirty. Its user is a frontline brawler whose goal is to create as much disruption as possible. It is devastating when paired with a netrunner who can use 'Ping' to reveal clustered enemy positions, setting up the perfect chain-reaction explosion. A solo with high mobility is also key, as they can capitalize on the panic and confusion caused by the explosions and potential cyberpsycho outbreaks. The entire crew must maintain situational awareness, as the weapon's effects are indiscriminate. Its role is not to support a plan, but to be the plan."
    }
  }
}