{
  "weaponProfile": {
    "title": "The Dentist",
    "image": "/pain-drill.png",
    "id": "maelstrom_pain_drill_legendary",
    "aliases": ["The Auger", "Brick's Folly", "The Chrome-Ripper"],
    "type": "Melee (Brutal Arms)",
    "manufacturer": "Maelstrom (Unique Masterwork)",
    "status": "Unique; Infamous Artifact",
    "cost": "€$78,000 (Black Market Estimate)",
    "specialAbility": "A fully charged heavy attack causes the drill to spin at supersonic speeds, instantly destroying enemy armor and applying a devastating Bleed. The overclocked engine has a high chance to ignite the wielder, granting bonus Melee Damage but dealing Thermal damage over time.",
    "baseStats": {
      "attackSpeed": 1.5,
      "damage": "550",
      "reloadSpeed": 0,
      "range": 2.8,
      "mods": 1
    },
    "keyRelationships": {
      "nemesis": "Officer Zander 'The Surgeon' Williams (NCPD | MAX-TAC). Williams is a decorated MAX-TAC officer and the sole survivor of the 'Siege of All Foods,' where his entire squad was torn apart by the first Pain-Drill. He is a man who believes in clean, surgical takedowns and sees 'The Dentist' as an abhorrent, chaotic perversion of combat. He is obsessed with tracking down and destroying the weapon, viewing it as a personal insult to his profession and a ghost from his greatest failure.",
      "creator": "Brick (Former Maelstrom Leader)"
    },
    "legendaryOrigin": {
        "gigTitle": "The Siege of All Foods",
        "date": "Circa 2073",
        "objective": "A then-lieutenant named Brick and his Maelstrom crew were cornered in the All Foods plant during a full-scale MAX-TAC raid led by Officer Zander Williams.",
        "client": "N/A (Territorial Defense)",
        "target": "The MAX-TAC Siege Line",
        "outcome": "A legendary, desperate innovation. Pinned down and unable to breach the MAX-TAC armor line, Brick, in a fit of brutal genius, bolted an industrial rock drill to an overclocked vehicle engine. The resulting weapon, 'The Dentist,' was uncontrollable and terrifying. Brick used it to charge the MAX-TAC line, the drill tearing through shields and armor with horrifying ease. The assault was a success, breaking the siege, but the weapon's chaotic nature caused significant friendly fire casualties. Williams' squad was wiped out, and he was left as the sole, traumatized survivor.",
        "mercFate": "N/A. This was a pivotal event in Maelstrom's history.",
        "mercFeedback": "'They had us pinned. Armor was too thick. Bullets were just sparks. So I made something that didn't care about armor. Something that just... digs. It was loud, it was angry, and it screamed. We lost good people in the chaos. But we won. That's Maelstrom.' - Brick, reflecting on the weapon's creation.",
        "payout": "Survival, and the birth of a legend.",
        "reputationImpact": "This event cemented Brick's reputation and eventual rise to leader of Maelstrom. 'The Dentist' became his signature weapon, a symbol of their philosophy that flesh, chrome, and armor are all just meat for the grinder. It also created a lifelong, obsessive enemy in Officer Williams, who would dedicate his career to hunting the weapon and its creator."
    },
    "designAndMaterials": {
        "materials": "The core of 'The Dentist' is a diamond-tipped industrial rock drill, scarred and pitted from its first use. It is crudely but securely welded to the engine block of a Quadra Type-66, its internal governors disabled. The entire weapon is covered in scorch marks and the faded Maelstrom graffiti of Brick's old crew.",
        "ammunitionType": "N/A. It runs on a volatile, high-octane CHOOH2 mixture that frequently leaks and ignites, a 'feature' that Maelstrom gangers have come to embrace.",
        "compatibleMods": [
            { "slot": "Internal", "mod": "Brick's Unstable Engine", "description": "This unique, master-crafted engine is the heart of the weapon. It provides unparalleled armor-shredding power but is the source of the self-igniting flaw, making every charged attack a dangerous gamble." }
        ]
    },
     "weaponPhilosophy": {
      "concept": "The Pain-Drill is the ultimate expression of Maelstrom's nihilistic philosophy: if it's chromed, it's a cage, and all cages must be broken. It rejects the elegance of blades and the cowardice of bullets. Its purpose is singular and absolute: to unmake. The deafening scream of the engine and the grinding of the drill are not side effects; they are the point. It is a weapon designed to inflict maximum terror and to prove that no amount of armor, no matter how expensive, can protect you from raw, chaotic, and painful deconstruction."
    },
    "manufacturingIntel": {
      "creatorReputation": "The Pain-Drill isn't forged; it's desecrated. 'The Dentist' is the original, the masterwork created by Brick himself in a moment of desperate inspiration. The other Pain-Drills used by Maelstrom are attempts to replicate its brutal genius, but they lack the raw, unstable power of the original.",
      "developmentHistory": "After Royce's coup, Brick was imprisoned and 'The Dentist' was claimed by Royce as a trophy, a symbol of his new leadership. It represents the 'old ways' of Maelstrom, a relic of a time before Royce's more calculated paranoia. The weapon is a constant, humming reminder of the leader he overthrew.",
      "productionDate": "Circa 2073"
    },
    "tacticalAssessment": {
      "strengths": [
        "Unmatched armor-shredding capability, capable of neutralizing heavily armored targets in a single charged attack.",
        "The self-ignite feature provides a high-risk, high-reward damage boost for berserker playstyles.",
        "High base damage and stagger chance on light attacks.",
        "Immense psychological impact; the high-pitched scream of the drill can cause panic."
      ],
      "weaknesses": [
        "The slowest melee weapon in its class, with a long, telegraphed wind-up on heavy attacks.",
        "The self-ignite effect can be fatal without significant investment in thermal resistance.",
        "Has zero defensive or parrying capability; it is a tool of pure, relentless offense.",
        "Possession of this weapon will make you a priority target for MAX-TAC, specifically Officer Williams's squad."
      ],
      "recommendedRoles": "Berserker, Juggernaut, Armor-Shredder, Psycho-Brawler.",
      "masteryArchetype": "A 'Maelstrom Juggernaut' build. A user who has embraced the abyss, with a high Body attribute, a Berserk OS, and cyberware that grants immunity to their own status effects. The ideal user charges headfirst into the most heavily armored enemy on the field, using 'The Dentist' to open them up like a tin can so the rest of the squad can pour in."
    },
    "acquisitionIntel": {
      "marketAvailability": "Unique. This weapon is a symbol of Maelstrom leadership and cannot be bought.",
      "rumoredLocation": "It is currently held as a personal trophy by Royce, the de-facto leader of Maelstrom. It is kept in his private command center within the All Foods plant, a reminder of the man he overthrew. It is said he sometimes uses it to 'discipline' members who fail him. The only way to acquire it is to confront Royce himself."
    },
    "fieldTestimonials": [
      
    ],
    "crewSynergyAssessment": {
        "analysis": "The Dentist is the crew's living siege engine. Its wielder has one job: identify the single most armored, most dangerous target on the field and erase them. They are not a defender; they are a guided missile of pure destruction. A successful crew will support this role. A netrunner can use quickhacks like Cripple Movement or Cyberware Malfunction to hold the target in place for the Pain-Drill's slow, devastating charged attack. A sharpshooter can eliminate ranged threats, allowing the wielder to focus on their primary target without being kited. Its role is to be the answer to the question, 'how do we crack the uncrackable?'"
    }
  }
}