{
  "weaponProfile": {
    "title": "Seeker",
    "image": "/seeker.png",
    "id": "tsunami_seeker",
    "aliases": ["The Corner-Cutter", "The Trick Shot", "Tag and Bag"],
    "type": "Tech Pistol",
    "manufacturer": "Tsunami",
    "status": "Active; Specialist Market",
    "cost": "€$90,000",
    "specialAbility": "Alt-fire shoots a non-damaging tracer dart. All primary fire shots will home in on the active tracer, even around corners. Tracers last for 10 seconds.",

    "baseStats": {
      "attackSpeed": 4,
      "damage": 120,
      "reloadSpeed": 1.4,
      "range": 50,
      "mods": 3
    },

    "manufacturingIntel": {
      "creator": "Tsunami Defense Systems (Urban Solutions Division)",
      "creatorReputation": "Tsunami is known for its reliable, if somewhat uninspired, firearms. The Seeker was a rare and brilliant exception, born from a project to create the ultimate weapon for dense, urban environments. The design team was led by a former NCPD SWAT officer who was tired of losing squad members to enemies hunkered down behind impossible cover.",
      "developmentHistory": "The Seeker's innovation is the 'Magnetic-Pulse Tagging System.' The alt-fire launches a silent, adhesive dart that emits a low-frequency magnetic pulse. The primary-fire projectiles are then micro-magnetized as they leave the barrel, causing them to aggressively seek out the active pulse tag. This allows the user to 'tag' a target and then fire into a nearby wall or ceiling, letting the ricocheting, homing bullets do the work. It was deemed 'too complex' for standard NCPD issue but became a high-demand item for elite solos and tech-savvy mercs.",
      "productionDate": "Circa 2073"
    },

    "tacticalAssessment": {
      "strengths": [
        "Unparalleled ability to eliminate enemies behind cover without exposing the user.",
        "Excellent for flushing out entrenched snipers, netrunners, or heavy gunners.",
        "The tracer dart is silent, allowing for a stealthy 'tag' before initiating combat.",
        "Rewards creative thinking and use of the environment."
      ],
      "weaknesses": [
        "Requires a two-step process to use effectively, making it slower in a direct firefight.",
        "The homing projectiles can be unreliable in open areas with no surfaces to ricochet from.",
        "Lower base damage per shot compared to a heavy revolver or tech rifle.",
        "Missing the tracer dart can leave you vulnerable while you reload it."
      ],
      "recommendedRoles": "Tactical Solo, Combat Techie, Urban Combat Specialist.",
      "masteryArchetype": "A 'Bank Shot' build. A merc with a high Intelligence and Cool attribute who excels at battlefield geometry. The ideal user combines the Seeker with the 'Ricochet Eyeballs' cyberware to visualize the perfect shot. They don't engage in direct firefights; they win them from the safety of another room, peppering a tagged target with a volley of impossible, ricocheting shots. They are masters of indirect warfare."
    },

    "acquisitionIntel": {
      "marketAvailability": "Uncommon but available. The Seeker is a specialist weapon and can be found at high-end weapon vendors in Japantown and City Center. Tech-focused ripperdocs and weapon dealers, like the one in Arroyo, are also known to carry it.",
      "rumoredLocation": "The NCPD's lead cyberpsycho-squad commander, a woman known for her creative tactics, is said to carry a heavily modified Seeker with an extended tracer duration. She reportedly uses it to tag and neutralize cyberpsychos without ever entering their direct line of sight."
    },

    "fieldTestimonials": [
      {
        "merc": "'Ricochet' (Solo)",
        "context": "Clearing a 6th Street-held fortified position.",
        "feedback": "'They were all dug in, heavy cover, impossible to get a clean shot. I just tagged the lead heavy, took a step back, and emptied my clip into the wall next to the doorway. Heard a whole lot of screaming. It's not a gun; it's a solution to the problem of cover. An elegant, beautiful solution.'",
        "rating": "5/5"
      },
      {
        "merc": "'Juggernaut' (Brawler)",
        "context": "Ambushed in an open plaza by Valentinos.",
        "feedback": "'This pea-shooter is too complicated. Tag 'em, then shoot 'em? Why not just shoot 'em in the first place? And in the open, the bullets just fly off into space. It's a gimmick. Give me something that hits hard and straight.'",
        "rating": "2/5 (Too much thinking)"
      },
      {
        "merc": "'V' (Mercenary)",
        "context": "Data heist from a guarded server room.",
        "feedback": "'The guards were in a room with only one entrance. I wasn't about to stick my head in there. I just bounced the tracer dart off the back wall, tagged the netrunner, and then filled the room with hot lead from the hallway. Felt like I was cheating. It was great.'",
        "rating": "4/5 (Makes you feel smart)"
      }
    ]
  }
}