{
  "weaponProfile": {
    "title": "Kage-no-Yaiba",
    "image": "/whisper.png",
    "id": "arasaka_whisper_prototype_01",
    "aliases": ["The Ghost's Kiss", "The Flatline Foil", "Blade of Shadows"],
    "type": "Melee (Mono-edge Blade)",
    "manufacturer": "Arasaka (Special Operations Division)",
    "status": "Unique Prototype; Stolen",
    "cost": "Priceless (A Matter of Honor)",
    "specialAbility": "Lunging heavy attacks have a 100% Crit Chance and bypass a portion of enemy armor. Successful stealth takedowns with this weapon activate a more powerful, longer-lasting Optical Camo and grant a brief, massive boost to movement speed.",
    "baseStats": {
      "attackSpeed": 4.5,
      "damage": "280",
      "reloadSpeed": 0,
      "range": 3,
      "mods": 2
    },
    "keyRelationships": {
      "nemesis": "Sandayu Oda (Arasaka | Master Assassin). 'Kage-no-Yaiba' was forged for and is spiritually bonded to Oda. It was his personal weapon and a symbol of his status as Saburo Arasaka's phantom. Its theft by his disgraced predecessor, Goro Takemura, was not just a loss of property, but the deepest personal and professional insult imaginable. Oda is not just hunting a weapon; he is hunting a piece of his own soul, and he will cut down anyone who stands in his way to reclaim it and restore his honor."
    },
    "legendaryOrigin": {
        "gigTitle": "The Flight of the Ronin",
        "date": "Mid-2077",
        "objective": "After being stripped of his rank and sentenced to death, the disgraced Arasaka agent Goro Takemura was forced to flee Night City. To survive, he needed a weapon worthy of his skill.",
        "client": "Self-Preservation",
        "target": "An untraceable, master-crafted weapon.",
        "outcome": "An legendary act of defiance and theft. Knowing he was being hunted by his own, Takemura used his deep knowledge of Arasaka protocols to infiltrate his replacement's personal armory. He bypassed the security on Sandayu Oda's private quarters and stole his greatest treasure: the one-of-a-kind 'Kage-no-Yaiba.' The theft was a calculated, deeply personal insult to the man who had replaced him, a message that even in disgrace, his skills were superior. He then used the blade to cut his way out of Night City.",
        "mercFate": "N/A. This was a personal act of survival by a key historical figure.",
        "mercFeedback": "'The security logs show a ghost. No alarms, no forced entry. The blade was simply... gone. For a man like Oda, this is not theft. It is a violation. The ronin, Takemura, did not just steal a weapon; he stole a piece of Oda's very soul. A blood debt was created that day, one that can only be paid with a final duel.' - An Arasaka internal security report.",
        "payout": "Survival, and the ultimate tool for a ronin's revenge.",
        "reputationImpact": "This event turned 'Kage-no-Yaiba' from a classified secret into a legendary object of desire. It became a symbol of defiance against Arasaka and the centerpiece of one of the most intense personal rivalries in the corporate world. To wield it is to carry the weight of a ronin's struggle and the burning hatred of a master assassin."
    },
    "designAndMaterials": {
        "materials": "The blade is a single, flawless mono-molecular edge, suspended in a dark, synthetic diamond frame, making it unimaginably sharp and light. The hilt is wrapped in the silk from a pre-Collapse Arasaka family heirloom and contains a custom, bio-linked micro-projector that is keyed directly to the user's neural patterns.",
        "ammunitionType": "N/A. The blade is so sharp that it is rumored to cut through the very air, creating its signature, whisper-quiet sound.",
        "compatibleMods": [
            { "slot": "Hilt", "mod": "Oda's Vow", "description": "The unique, bio-linked hilt provides a perfect interface with the user's chrome, significantly increasing the duration of the Optical Camo effect and the speed boost on a stealth kill." },
            { "slot": "Edge", "mod": "Ghost-in-the-Flesh Edge", "description": "A master-crafted monofilament edge that resonates at a specific frequency, allowing it to bypass not just physical armor, but also a portion of the target's cybernetic damage resistance." }
        ]
    },
     "weaponPhilosophy": {
      "concept": "The Whisper was created to be the physical embodiment of the Arasaka assassin's creed: 'One cut, one kill.' Its philosophy is that of the perfect, unseen predator. It is not a weapon for a soldier in a firefight; it is a tool for a ghost in the shadows. The goal is not to win a battle, but to ensure a battle never occurs. The brief invisibility granted by a kill is the core of its design, allowing the user to flow from one shadow to the next, a phantom that erases its targets without ever leaving a trace."
    },
    "manufacturingIntel": {
      "creatorReputation": "This blade was not designed by a single person, but by Arasaka's elite 'Kage' (Shadow) Program. 'Kage-no-Yaiba' was their magnum opus, a one-of-a-kind blade forged by a master smith and imbued with cutting-edge tech, specifically for their top operative.",
      "developmentHistory": "'Kage-no-Yaiba' is a unique masterpiece. The standard-issue 'Whisper' blades given to Arasaka assassins are formidable, but they are mass-produced copies that lack the perfect balance, the more powerful neuro-link, and the legendary history of the original. Oda's blade is not just the best; it is the first, a true work of art.",
      "productionDate": "Circa 2076"
    },
    "tacticalAssessment": {
      "strengths": [
        "Unmatched for stealth operations, with the ability to chain silent kills via enhanced invisibility and speed.",
        "The guaranteed critical hit on a lunging attack makes it perfect for initiating combat from the shadows.",
        "Extremely high attack speed allows for rapid follow-up strikes.",
        "Bypasses armor on its most powerful attack, making it effective against elite guards."
      ],
      "weaknesses": [
        "Very low base damage on light attacks; relies on critical hits and stealth multipliers.",
        "Fragile; has a very low chance to parry or block heavy melee attacks.",
        "Ineffective in open, prolonged firefights against multiple opponents.",
        "Possession of this weapon will make you the primary target of Sandayu Oda, one of the deadliest men alive."
      ],
      "recommendedRoles": "Stealth Assassin, Infiltrator, Netrunner-Solo Hybrid.",
      "masteryArchetype": "A 'Shinobi' build. A user with sky-high Cool and Reflexes attributes who treats combat like a deadly puzzle. They use quickhacks to distract and isolate targets, then use the Whisper's lunge to strike from the shadows. The enhanced invisibility from the kill allows them to immediately reposition and select their next target. They are a ghost, a rumor, and the last thing their enemies never see."
    },
    "acquisitionIntel": {
      "marketAvailability": "Unique. This weapon is a symbol of stolen honor and cannot be bought.",
      "rumoredLocation": "The weapon was last seen in the possession of Goro Takemura. After the events at Arasaka Tower, its fate is unknown. Some believe it was recovered by Oda after Takemura's death. Others claim V, the merc who aided Takemura, inherited the blade and now carries its heavy legacy. The only certainty is that Oda is relentlessly searching for it, and will follow any lead, no matter how small."
    },
    "fieldTestimonials": [
      
    ],
    "crewSynergyAssessment": {
        "analysis": "Kage-no-Yaiba is the ultimate tool for a crew's designated 'ghost.' Its user operates on a separate plane from the rest of the team, their role being to silently eliminate all perimeter guards, snipers, and netrunners before the main assault even begins. It synergizes perfectly with a netrunner who can use camera control and distraction quickhacks to guide the wielder and create openings. In the event of open combat, the wielder's role shifts to that of a hyper-mobile assassin, using the dash-strike and camo to flank and eliminate high-value targets while the rest of the crew provides a frontline distraction. Its purpose is to ensure the fight is always unfair."
    }
  }
}