{
  "weaponProfile": {
    "title": "Yurei",
    "image": "/yurei.jpg",
    "id": "arasaka_yurei",
    "aliases": ["The Ghost", "Icepick", "Tanaka's Shame"],
    "type": "Smart SMG",
    "manufacturer": "Arasaka (Advanced R&D Division)",
    "status": "Blacklisted Prototype; Actively Hunted",
    "cost": "Doest exist in the market",
    "specialAbility": "Fires cryogenic rounds that slow enemies and can flash-freeze them solid on a critical hit. The weapon is completely silent, registering no higher on audio sensors than a whisper.",
    "baseStats": {
      "attackSpeed": 11.0,
      "damage": 75,
      "reloadSpeed": 1.9,
      "range": 40,
      "mods": 3
    },
    "keyRelationships": {
      "nemesis": "Dr. Kenji Tanaka (Disgraced Arasaka Engineer). The Yurei's creator. After his prototypes were stolen in a legendary heist, Arasaka disgraced him. Tanaka is now a man obsessed, operating outside the system with a singular goal: to reclaim his three 'children' and eliminate those who possess them. He uses a hidden bio-tracker linked to the weapon's grip to hunt its wielders, making every use of the Yurei a potential beacon for his wrath."
    },
    "legendaryOrigin": {
        "gigTitle": "The Silent Heist",
        "date": "03.12.2076",
        "objective": "Infiltrate the Arasaka Advanced R&D lab in orbit and steal the only three working prototypes of Dr. Tanaka's 'Project Yurei.'",
        "client": "Arthur 'The Architect' Cormac",
        "target": "Three 'Yurei' Prototype SMGs.",
        "outcome": "A legendary success that created a ghost. Cormac, seeking the ultimate tool for his own operations, hired a legendary netrunner known only as 'Hush.' She didn't just breach the lab's security; she created a digital 'time loop' in the security feeds, making it appear as if the prototypes were still in their cases for a full 24 hours after the theft. This flawless heist allowed her to escape with all three prototypes, leaving Arasaka blind and humiliated. Dr. Tanaka was made the scapegoat for the security failure and was permanently disgraced.",
        "mercFate": "'Hush' received one prototype as payment and vanished into the net, becoming a ghost herself. Arthur Cormac claimed the second for his personal arsenal of tools. The third was fenced on the high-end black market to cover operational costs, which is how the weapon first entered the underworld's circulation.",
        "mercFeedback": "'Cormac's plan was a whisper. My job was to make it silent. I walked through Arasaka's best ICE like it was mist. The weapons... they felt like they were made for me. Cold, quiet, and final. I took my payment and disappeared. Some things are too perfect to ever let go of.' - Final encrypted message from 'Hush'.",
        "payout": "One of the three Yurei prototypes.",
        "reputationImpact": "This gig was the true birth of the Yurei's legend. It was a perfect, invisible theft that embarrassed Arasaka, created the myth of the netrunner 'Hush,' and equipped the ghost of City Center, Arthur Cormac, with his ideal weapon. It also turned a brilliant engineer into a vengeful hunter."
    },
    "designAndMaterials": {
      "materials": "The Yurei's chassis is constructed from a lightweight, non-RF reflective polymer composite. The core components and barrel are milled from a titanium-tungsten alloy for durability. The grip is lined with a bio-synthetic material that adapts to the user's hand and contains a microscopic, encrypted bio-signature transmitter—the source of Dr. Tanaka's tracking system.",
      "ammunitionType": "Utilizes a proprietary 7mm Cryo-Shard Caseless round. Each projectile consists of a fin-stabilized, armor-piercing flechette suspended in a supercooled liquid nitrogen solution. Upon firing, a magnetic coil propels the flechette while the solution acts as a natural sound dampener. This system eliminates both gunpowder and a traditional firing pin, resulting in total silence.",
      "compatibleMods": [
        { "slot": "Optics", "mod": "Arasaka 'Tsunami' Smart Scope", "description": "A proprietary scope that highlights enemy weak points and predicts movement patterns, increasing critical hit chance against slowed or frozen targets." },
        { "slot": "Muzzle", "mod": "Cryo-Intensifier", "description": "Focuses the cryogenic aerosol into a tighter cone, significantly increasing the duration of the slowing effect and the chance to freeze targets solid." },
        { "slot": "Internal", "mod": "Overclocked Targeting CPU", "description": "Boosts the smart-targeting processor, allowing for faster lock-on and the ability to maintain target locks on up to five enemies simultaneously." }
      ]
    },
    "weaponPhilosophy": {
      "concept": "The Yurei was not designed as a weapon of war, but as an instrument of control. Its philosophy is rooted in the Arasaka principle of 'perfect execution.' A traditional firearm announces its presence with sound and fury, admitting a loss of control. The Yurei, by contrast, removes threats from the equation without a whisper. It turns a chaotic firefight into a silent, methodical problem-solving exercise. It is the physical embodiment of fear, silence, and surgical lethality."
    },
    "manufacturingIntel": {
      "creator": "Dr. Kenji Tanaka",
      "creatorReputation": "Dr. Tanaka was a legendary weapons engineer in Arasaka's R&D wing, known for his obsession with 'elegant lethality.' After the theft of his prototypes, he was disgraced and officially 'retired.' He now operates in the shadows, a brilliant and bitter man singularly focused on reclaiming his creations and punishing those who stole them.",
      "developmentHistory": "The 'Yurei' was the pinnacle of Dr. Tanaka's career. The project was officially terminated by Arasaka after the prototypes were stolen to erase the corporate embarrassment. No more were ever produced, making the three stolen prototypes the only ones in existence.",
      "productionDate": "Circa 2075-2076"
    },
    "tacticalAssessment": {
      "strengths": [
        "Completely silent operation allows for full-auto combat in stealth scenarios.",
        "Cryogenic rounds provide exceptional crowd control, slowing multiple targets.",
        "Devastating against enemies vulnerable to Cold or those with overheating cyberware.",
        "Smart-targeting ensures high accuracy even in chaotic situations."
      ],
      "weaknesses": [
        "Lower base damage compared to traditional Power SMGs.",
        "Ineffective against heavily armored or robotic enemies resistant to Cold.",
        "Proprietary ammunition is extremely rare and expensive.",
        "Possession of this weapon makes you a high-priority target for both Arasaka recovery teams and its obsessed creator."
      ],
      "recommendedRoles": "Netrunner-Solo Hybrid, Stealth Assassin, Corporate Infiltrator.",
      "masteryArchetype": "A 'Ghost' or 'Shinobi' build. An operative who combines netrunning with a Sandevistan or Kerenzikov for rapid, silent takedowns. The weapon's true potential is unlocked by a user who can chain critical hits to keep entire squads frozen and helpless."
    },
    "acquisitionIntel": {
      "marketAvailability": "Effectively Zero. The three prototypes in existence are not on any market. One is held by Arthur Cormac, one is with the netrunner 'Hush,' and the third's location is a subject of intense speculation.",
      "rumoredLocation": "The third Yurei is the stuff of legend. Whispers suggest 'Hush' sold it to Rogue Amendiares as a sign of respect before she disappeared. Others claim it's the centerpiece of Kurt Hansen's private collection in Dogtown. The only certainty is that finding it would be the gig of a lifetime."
    },
    "fieldTestimonials": [
      {
    }
    ],
    "crewSynergyAssessment": {
      "analysis": "The Yurei is a force multiplier for any crew that prioritizes stealth over brute force. It is the perfect weapon for the crew's Infiltrator or Netrunner, allowing them to neutralize threats without compromising the team's position. A successful crew will pair the Yurei's user with a heavy-hitter who can take over if and when stealth is broken. Its role is to ensure the fight never has to happen in the first place."
    }
  }
}